tap "aquasecurity/trivy"
tap "goodwithtech/r"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "liamg/tfsec"
tap "mongodb/brew"
tap "mono0926/license-plist"
tap "neovim/neovim"
tap "shyiko/ktlint"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Utility for easily assuming AWS IAM roles from the command-line
brew "awsume"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: true
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Core application library for C
brew "glib"
# Decentralized dependency manager for Cocoa
brew "carthage"
# Generic library support script
brew "libtool"
# Manage compile and link flags for libraries
brew "pkg-config"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Emacs dependency management
brew "cask"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl-openssl"
# Turn other processes into daemons
brew "daemon"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"
# GNU awk utility
brew "gawk"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Postgres C API library
brew "libpq"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Get strong typed, autocompleted resources like images, fonts and segues
brew "rswift"
# Utility that provides fast incremental file transfer
brew "rsync"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# General-purpose lossless data-compression library
brew "zlib"
# Additional completion definitions for zsh
brew "zsh-completions"
brew "aquasecurity/trivy/trivy"
# Simple security auditing, helping build the Best Docker Images
brew "goodwithtech/r/dockle"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Tail logs from multiple Kubernetes pods at the same time
brew "johanhaleby/kubetail/kubetail"
# Static analysis powered security scanner for your terraform code
brew "liamg/tfsec/tfsec"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# A license list generator of all your dependencies for iOS applications
brew "mono0926/license-plist/license-plist"
# Kotlin linter
brew "shyiko/ktlint/ktlint"
cask "1password"
cask "balenaetcher"
cask "brave-browser"
cask "charles"
cask "diffmerge"
cask "docker"
cask "figma"
cask "flux"
cask "font-fira-code"
cask "font-hack"
cask "font-source-code-pro"
cask "google-cloud-sdk"
cask "brave"
cask "hazel"
cask "iterm2"
cask "jetbrains-toolbox"
cask "macdown"
cask "miro"
cask "ngrok"
cask "notion"
cask "paw"
cask "postico"
cask "postman"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "sketch"
cask "skype"
cask "spotify"
cask "sublime-text"
cask "webpquicklook"
cask "zeplin"
cask "zoom"
mas "Irvue", id: 1039633667
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
