tap "aquasecurity/trivy"
tap "goodwithtech/r"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "johanhaleby/kubetail"
tap "liamg/tfsec"
tap "minio/stable"
tap "mongodb/brew"
tap "mono0926/license-plist"
tap "neovim/neovim"
tap "shyiko/ktlint"
brew "automake"
brew "aws-iam-authenticator"
brew "awsume"
brew "bash-completion"
brew "bat"
brew "gettext"
brew "glib"
brew "pkg-config"
brew "python@3.9"
brew "carthage"
brew "coreutils"
brew "libtool"
brew "unbound"
brew "gnutls"
brew "cask"
brew "circleci"
brew "curl"
brew "daemon"
brew "dark-mode"
brew "gawk"
brew "gdk-pixbuf"
brew "git"
brew "git-extras"
brew "gnu-sed"
brew "pinentry"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "gradle"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "helm"
brew "htop"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "krb5"
brew "kubernetes-cli"
brew "libpq"
brew "libyaml"
brew "mas"
brew "maven"
brew "neovim"
brew "nghttp2"
brew "nmap"
brew "node"
brew "p7zip"
brew "pgcli"
brew "pinentry-mac"
brew "postgresql@14"
brew "pre-commit"
brew "rsync"
brew "speedtest-cli"
brew "stow"
brew "subversion"
brew "terraform-docs"
brew "tfenv"
brew "tflint"
brew "trash"
brew "tree"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh-completions"
brew "aquasecurity/trivy/trivy"
brew "goodwithtech/r/dockle"
brew "heroku/brew/heroku"
brew "johanhaleby/kubetail/kubetail"
brew "liamg/tfsec/tfsec"
brew "mongodb/brew/mongodb-database-tools"
brew "shyiko/ktlint/ktlint"
cask "1password"
cask "balenaetcher"
cask "brave-browser"
cask "charles"
cask "diffmerge"
cask "docker"
cask "figma"
cask "font-fira-code"
cask "font-hack"
cask "font-source-code-pro"
cask "google-cloud-sdk"
cask "iterm2"
cask "jetbrains-toolbox"
cask "loom"
cask "macdown"
cask "microsoft-teams"
cask "miro"
cask "ngrok"
cask "notion"
cask "paw"
cask "postico"
cask "postman"
cask "slack"
cask "spotify"
cask "sublime-text"
cask "zeplin"
cask "zoom"
mas "Commander One", id: 1035236694
mas "FileZilla Pro", id: 1298486723
mas "ForkLift", id: 412448059
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Parcel", id: 639968404
mas "Spark", id: 1176895641
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
